{"data":{"site":{"siteMetadata":{"title":"乐园遗梦","author":"inori_lover"}},"markdownRemark":{"id":"fec03353-7392-502b-8ce9-8b442b429bbe","excerpt":"年头 emmm……年头还是在我人生中的第二个任职公司当咸鱼。新年那段时间的话应该还算是在一个贷款项目了，还在无尽的bug修复阶段，老板提bug…","html":"<h1>年头</h1>\n<p>emmm……年头还是在我人生中的第二个任职公司当咸鱼。新年那段时间的话应该还算是在一个贷款项目了，还在无尽的bug修复阶段，老板提bug（需求），我负责实现。回头看了一下，自己写的东西确实有点不堪入目，主要都是体现在系统设计能力不足上边：一个联动搜索被我做成那个鬼样……也是挺不容易：一直用jq做页面切换侦听，结果就跌进去死循环了，最后只能完全锁死返回操作，然后返回操作的回填也难受。换成现在的我的话，估计会考虑绕开返回上一页这么一个傻逼操作了：ios的侧滑返回在微信实在是无法解决，各种奇奇怪怪的方法搞来搞去不如调整一下ui做成卡片式，在卡片上滑动就返回上一个表单填写。在最后做一次合并提交。</p>\n<p>另一个当时觉得贼恶心的事情就是提交的问题，因为需要做搜索结果复现，所以搜索条件是肯定要存下来的了，关键是怎么存- -搜索条件分成两类，一个是关键词，一个是筛选条件，筛选条件用 问题答案id键值对 做储存就没问题了，二次筛选事件产生时就按照键去搜索修改。</p>\n<h1>劳动节前后？</h1>\n<p>经历了两个比较难忘的事情……一个是要做面试，第一次在面试官角度来思考招聘究竟是个啥东西。结果来说还是招聘这东西除非是大公司几段式有流程那种，不然都比较类似聊开心能然面试官觉得你能写代码就ok了。因为自己的要求就是那样……一次面试真的难确定招进来是不是真牛逼，都是靠看之前的经验做了啥，如果是没经验那就更难看出来了，只能看是不是连基础都不懂的**。</p>\n<p>另一个就是同事离职。在我没留意的地方同事已经提前下了决心做好准备走。</p>\n<h1>迎接新同事之后</h1>\n<p>其实这段也是属于前一段了：试着用webpack写了一套属于自己的多页开发环境。多页面生成，poyfill，minify，postcss，babel一应俱全，想了下之前自己傻乎乎一个个页面复制babel里边再粘贴真是傻- -配合着这个经验也顺利把公司项目的新改动内容搬到bebel里边了。</p>\n<p>整个配置感觉最难的不是写config上边，倒是整个项目结构的考虑。一开始是打算所有东西都在src里边做，但是html是在独立的templ目录不好跨目录读取内容，放templ同理，思来想去还是觉得整个项目包进去，虽然在项目的根目录可能会有多了几个配置问题但是至少是可用的；然后是src跟dist的选取上，本来是想着混杂在同一个目录下边，最后推翻了这个想法：监听过滤太难受了，如果是<code class=\"language-text\">src/dist</code>这种类型由稍显累赘，最后决定了dist走过去，src与dist同级，templ文件夹那边同理，顺便用来做转换进度指标。</p>\n<h1>接手做一个全新的项目</h1>\n<p>公司给了一个全新的项目要求做PC端商城，回头看意想不到的地方是此时我依然不敢上react的车- -当然，对后端的不信任也有一丝考虑在内但主要还是自己不敢动的问题。要是直接用react的话估计没有后边那么多问题了吧- -被傻逼后端改代码改成页面崩坏的状况。完全不可能发生了。</p>\n<p>没记错的话我对react的恐惧应该起于我还不怎么了解其操作dom的能力，可能连ref都不了解？（不过如果这个时候还不理解的话什么时候学到的……）然后看了一下老板丢过来的目标网站感觉好多东西还是要dom比较稳（这个也是菜鸡想法了）。</p>\n<p>整体回忆起来项目dom依靠比较重的应该是两个，一个是放大镜效果一个tab切换过渡效果。放大镜不用怎么说了，didMount监听一下ref的mouseOver，判断target然后对头的话直接取offsetX/Y就完事了……至于Tab过渡效果，触发class变动直接写过渡。</p>\n<h1>emmmmm…然后就是等辞职？</h1>\n<p>中间公司也出了几个奇怪的政策，比如“军令状”这个东西。因为公司的交付周期并没有老板想象中的快（其实也当然，什么需求都不拒绝。。。），所以老板就一直在考虑怎么提一下这个速度了，最后的出招是自己定时间我们自己凑进度。嘛，虽然一开始觉得很苦但是回头一看好像也就那样（毕竟现在是996的作息233），而且确实进度限制一下的队友也能好好的跟一下进度而不是一脸懵逼等指示。但说实话，那种资本家的嘴脸还是觉得适应不了，我喜欢企业家多过资本家。有人会质疑：“你只是不喜欢有人在给你加限制吧”不可否认肯定会有一丝这个意思在内，但是在我的认知里边，企业家更会注重一个东西：思考。书籍是人类进步的阶梯？放屁，思考才是。资本家和企业家在我的认知里边最大的不同其实在于用什么角度来督促我，或者说激励我：我更喜欢用一个有根基的蓝图来激励我，而不是xx天之后我们就可以上市，你们将成为我司元老云云。</p>\n<p>当然这件事情也提醒了我，人都是相同的：我喜欢一个有思考习惯的老板，老板（emm，面试官也算老板好了）也会喜欢有思考的人，不管这个思考是幼稚还是雄伟，有思考的人才不会腐烂。这也是激励我好好写下这个博客的思想动力之一（也有一些动力是好久甚至说好小时就存在的，比如交一些臭味相投的朋友，联系一下语文水平等等哈哈哈哈哈哈</p>\n<h1>找工作</h1>\n<p>有两个比较可惜的面试，一个是腾讯外包的，一个是华为的。腾讯外包的那个岗位说实话我是真的想进（现在也如此），面试官回忆起来也是那种会好好交谈的人，一开始其实觉得自己谈得挺好的，但后来就觉得有点不行了，最明显的转折点（自认）应该是问我学习手段吧。平常确实会看一些邮箱订阅或者关注的大神的博客作为认知开拓手段但是说实话过去那一年回家之后比较倾向于娱乐以至于一下都觉得自己一直在玩了……老子也是在好好努力的呀（哭）。然后之前回答问题时累积的一些缺点也慢慢放大导致面试官很怀疑个人的学习能力然后也放弃了我。不过最后那句评语：“出来一年的前端不应该这么菜”这句话到现在都还是有点怀疑- -至少现在遇到的跟我同级别的队友都没写出过什么能然我惊叹的代码，互相请教也是常规。</p>\n<p>下一个想说一下就是华为的面试，华为的面试其实是有两次，两次的技术面试其实都还行，至少问的都答出来，小答卷也做出来（印象比较深是要我写一个dom ast 解析，不过说起来也就是递归一下解析child节点），应该没什么特别可挑剔的。但问题就死在最后一轮上，第一个是问我对于加班的看法，老子一直安稳在96一下子跟我说有可能99，第一反应当然是呆住了：99简直反人类呀！好的，毙了。第二个面试跟我谈了半天最后托面试联系人跟我讲“稳定性不行”，沟通一下之后应该是在讲述过去项目的时候说得比较水。最有疑点的问题应该是“过去你最自豪或者最想谈一下的项目有哪些”，我个人的回答也很实诚，因为项目都写得不怎么如意所以想说的没什么，最想说的反而是自己把webpack配置写出来了用起来了。没把webpack推广开来这件事情给重点提一下真是失策，把整个开发流程给定下来这件事情确实是我最自豪的一件事情，找jq插件找bootstrap插件凑项目赶工期有什么好自豪哦……</p>\n<h1>新工作</h1>\n<p>通过各种手段好歹在近年末期间把工作定下来了，就是现在的公司。一开始的工作时间确实还真的有点不习惯就是了，慢慢的话也就麻痹了。反正本来的计划也是回家之后自己学习，灵活安排一下时间的话其实在公司还是在家都一样了。</p>\n<p>然后新公司让我最感动的一点就是完全是跟上时代了：react技术栈，gitlab管理代码，postman管理接口。光听的话完全就是我想要理想状态，但进到实际的话还是要考虑人的因素，前人总结得好：技术并不能阻止傻逼。就算是再好的技术，也需要适当的制度来管理，比如锁master（master只能通过merge来更新），比如自动化测试等，这些都是慢慢接触之后才认知到的点。</p>\n<h1>新工作 新项目</h1>\n<p>在新公司第一个单独负责的项目是一个小程序。说起来讽刺，一年前的我还觉得小程序就是个话题物，现在却要依靠它养活自己了233.回头总结一下的话，就只有一句话：rxjs选的真是没错……redux那套哲学在小程序根本走不通，巨无霸state库的更新会死人的。通过rxjs做全局服务，把store收窄到global变量里边，适当放出有用的数据到组件中间去是一个适当的想法。</p>\n<p>现在剩下的遗憾应该是轻信了产品说的大部分api都是在登陆状态下的这个鬼话……一开始没好好区分出来登录态跟用户信息的区别，我其实只要保证登录成功就可以走下去，用户信息在用的时候再检测就行了。反正接下来会有一个改版更新，重点修正应该就是登录态的维护了，独立出来一个uid服务以及用户信息服务应该是比较好的，在这个基础上登录判断也好做了。</p>\n<h1>新一年</h1>\n<p>最大的愿望应该还是想要好队友了。</p>\n<p>迟到的总结，以及祝福。</p>\n<p>2019年1月4日23点56分</p>","frontmatter":{"title":"2019年写的2018年终总结","date":"January 02, 2019"}}},"pageContext":{"slug":"/2019-01-02/","previous":{"fields":{"slug":"/2018-12-28/"},"frontmatter":{"title":"关于imm*类数据不可变库的一些想法"}},"next":{"fields":{"slug":"/2019-02-23/"},"frontmatter":{"title":"怎么切割emoji😮"}}}}