{"data":{"site":{"siteMetadata":{"title":"乐园遗梦","author":"inori_lover"}},"markdownRemark":{"id":"786a0014-71cf-510a-9814-8cc0891e6d3d","excerpt":"前言 我该打……我拖延了…… 攻壳系列是难得我从真人电影入坑并到最后走向原著并花钱入手实体书的作品（说来惭愧我花在二次元上的钱并不多……支持正版的行为更是屈指可数 哭），本身的优秀程度无需我多言，从原著在断更1…","html":"<h3>前言</h3>\n<p>我该打……我拖延了……</p>\n<p>攻壳系列是难得我从真人电影入坑并到最后走向原著并花钱入手实体书的作品（说来惭愧我花在二次元上的钱并不多……支持正版的行为更是屈指可数 哭），本身的优秀程度无需我多言，从原著在断更15年后依然被好莱坞相中并搬上大荧幕这点就足以通俗表明。说起来有趣的一点是，荧幕上攻壳的形象是灰暗而（相对）严肃的，但在阅读原著后才了解到，原著中的攻壳笔触其实相对明快，虽然涉及的领域、思考一致，但是很好地使用各种小闹剧一笔带走，并不会在阅读后让人产生压抑感。本文则是在阅读原著后再次观看 攻壳2：无罪 所带来的观感。（好险，差点扯远了</p>\n<h3>观看预警</h3>\n<p>从文体上来看本文不属于正统观后感或诸如此类的东西，因为我的文学功底并不好但是又十分想分享一点东西，所以本文属于看到哪想到哪就写到哪的类型。</p>\n<h3>剧透</h3>\n<p>本文包含大量剧透（其实也不算很大量…自认已经很节制了但是毕竟是感想总跟剧情分不开），不如说本文的行文线索就是整个电影的的播放进度……</p>\n<p>我是真的一边二周目一边暂停写感想的……</p>\n<h3>阅读建议</h3>\n<p>建议满足所有以下条件的人群阅读</p>\n<ol>\n<li>对本电影已经一周目了（最最最最最最最最基本的阅读观后感条件</li>\n<li>对剧情整体依旧保有着一个相对清晰的记忆（不然你会对下文感到特别诧异：这在说啥</li>\n<li>时间多无处打发且不在意浪费在一篇文笔糟糕得朴素博文上（🤦‍</li>\n<li>不会打我（>_&#x3C;</li>\n</ol>\n<h3>正文真的要来了</h3>\n<h3>正文</h3>\n<blockquote>\n<p>以下电影一词特指 <code class=\"language-text\">攻壳机动队2: 无罪</code><a href=\"https://movie.douban.com/subject/1291566/\">豆瓣</a>&#x26;<a href=\"https://bangumi.tv/subject/238\">Bangumi番组计划</a></p>\n</blockquote>\n<p>电影全程充斥了大量符号意义的文字，比如开头“觀”字覆盖的摄像头。在一开始观看时我还以为自己拿到了假冒伪劣的影像，一般而言科幻电影在描述未来产物时都会浓墨重彩的堆砌零件细节（是的我就是说Iron Man）,比如接下来几分钟后出现的十分带有未来感的警车。</p>\n<p>比较不明白的地方：在取回人偶核验情况时，托古沙和巴特两人经过的的是，一个跳蚤市场？一个带机密性质的场所建立在跳蚤市场上？</p>\n<p>托古沙和哈乐葳（我是按着日版繁中的翻译来的了……)的对话也是比较有意思的一段。首先是“自杀”与“自毁”一词的特意区分（在后边的剧情中就没有像此刻一样有意区分），一个不起眼的伏笔。我感觉好的电影就该像这样，在适当的时候抛出一个出刊符合主题背景的思考冲突，而结尾时遥相呼应。然后时关于幼童与人偶的思辨，这里始终觉得导演（编剧？）像表达的并不是台词所传述的那样，幼童是否是人类，又抑或是人类对人偶的思念的延续？这与最后的真相似乎有所相关，但又让我感到莫名的差距：这段对话似乎是在思考另一个同等严肃的问题。</p>\n<p>我最最最最最会心一笑（酸）的场景大概就是石川载巴特回去的一小节。背景音乐<a href=\"https://music.163.com/#/song?id=568219\">River of Crystals</a>缓缓响起，石川娓娓交待少校消失的故事背景，与巴特两人进行着单身味浓重的对话，挖出搭档change后巴特的些许落寂————“石川，你最近变多嘴了”（生气</p>\n<hr>\n<blockquote>\n<p> “Nothing last”, you said</p>\n<p> but everything still hold meaning in my heart</p>\n<p> …</p>\n<p> i hear your voice echoing</p>\n<p> but i am still alone, i am alone, alone…</p>\n</blockquote>\n<p>回家之后，只有一条老狗出来迎接，连啤酒都是老狗的标记，似乎这里只有这一条老狗在维持着巴特家的感觉……再看看我，连狗都没有……</p>\n<p>（不许吐槽老狗！我也不知道狗老不老！但这是必要的修辞手法！用来衬托主人公寂寞的心境……好吧，我编不下去了，鬼知道我写原稿的时候是怎么想的，我现在只是把稿子的字一个一个敲上来</p>\n<p>去了流氓地盘上看到巴特一言不合掏机枪的懵圈托古沙好可爱！\n一脸酷爽挺直腰挨骂的巴特也好可爱！还有托古沙那个小眼神：you see you !老爷子说的就是你！锤你小胸口！</p>\n<hr>\n<p>中途唱诗那段开始我就有点看不来了。剧情在看过原著后能跟上没错，但是对于各种场景切换，也就只有壮观一感，剩下都是懵圈。在心境有了改变后会做四周目的重温。</p>\n<p>全片的最后一段。救出小女孩后静静听取了事情缘由的巴特怒气反问：“难道你都没考虑过牺牲者？我倒可不是说那些人类，我说的是，那些被你牺牲的人偶！”女孩一愣，随后委屈反驳：“毕竟，毕竟我也不想变成人偶啊！”电影副标题中无罪一词，大概也意在此处了。因故袭击人类的人偶，看似万恶实则“无辜“；渴求救赎而呼喊的幼童，看似无罪却以本意”杀害“人偶。</p>\n<h3>后</h3>\n<p>敲完全篇之后，心里越发觉得全文并没有准确地把自己地心境给表现到文字上。但又无法：再推倒重来，大概也不会好到哪里去，甚至有更差的可能性。就这样吧，当作日记一般便是。</p>\n<p>晚安各位</p>\n<p>2018年12月10日00点45分</p>","frontmatter":{"title":"攻壳机动队2：无罪","date":"December 09, 2018"}}},"pageContext":{"slug":"/2018-12-09/","previous":{"fields":{"slug":"/2018-11-29/"},"frontmatter":{"title":"关于重试"}},"next":null}}